const select = $('#dropdown');

const cities = [
    {1: "Благовещенск"},
    {2: "Великий Новгород"},
    {3: "Владивосток"},
    {4: "Волжский"},
    {5: "Воронеж"},
    {6: "Екатеринбург"},
    {7: "Иваново"},
    {8: "Иркутск"},
    {9: "Казань"},
    {10: "Краснодар"},
    {11: "Набережные Челны"},
    {12: "Нальчик"},
    {13: "Нижний Новгород"},
    {14: "Новороссийск"},
    {15: "Новосибирск"},
    {16: "Норильск"},
    {17: "Омск"},
    {18: "Петропавловск-Камчатский"},
    {19: "Пятигорск"},
    {20: "Ростов-на-Дону"},
    {21: "Рязань"},
    {22: "Самара"},
    {23: "Санкт-Петербург"},
    {24: "Саратов"},
    {25: "Смоленск"},
    {26: "Сочи"},
    {27: "Сыктывкар"},
    {28: "Тверь"},
    {29: "Томск"},
    {30: "Тула"},
    {31: "Тюмень"},
    {32: "Ульяновск"},
    {33: "Хабаровск"},
    {34: "Южно-Сахалинск"}
];

let idx = 1;

cities.forEach(function (city) {
    select.append(new Option(city[idx], idx));
    idx++;
});

const promotions = [
    {"city": "Воронеж", "shop_name": "Рив Гош Воронеж-1 ЦЕНТР ГАЛЕРЕИ ЧИЖОВА", "day": 29.0, "month": "марта", "brand": "CARVEN НИША+JACQUES FATH НИША+COMME DES GARCONS+MOLINARD+SYLVAINE DELACOURTE+NASOMATTO+TIZIANA TERENZI+V CANTO+XERJOFF+ISABEY", "discount": "25", "discount_type": "клиентский день", "comment": "консультации по нишевой парфюмерии, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош Чернышевского,17А м.Чернышевская", "day": 29.0, "month": "марта", "brand": "CAUDALIE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЕВРОПОЛИС", "day": 30.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош Колпино", "day": 30.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Рязань", "shop_name": "Рив Гош Рязань-3 ПРЕМЬЕР", "day": 30.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Саратов", "shop_name": "Рив Гош Саратов-1 МАНЕЖ", "day": 29.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Сыктывкар", "shop_name": "Рив Гош Сыктывкар-2 МАКСИ", "day": 30.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Сыктывкар", "shop_name": "Рив Гош Сыктывкар-3 ПАРМА", "day": 31.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-31"},
    {"city": "Томск", "shop_name": "Рив Гош Томск-1 МОДНЫЙ БАЗАР", "day": 29.0, "month": "марта", "brand": "CHANEL", "discount": "25", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Новосибирск", "shop_name": "Рив Гош Новосибирск-1 АУРА", "day": 29.0, "month": "марта", "brand": "CLARINS+THIERRY MUGLER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Омск", "shop_name": "Рив Гош Омск-2 ОМСКИЙ", "day": 30.0, "month": "марта", "brand": "CLARINS+THIERRY MUGLER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Смоленск", "shop_name": "Рив Гош Смоленск-1 МАКСИ", "day": 30.0, "month": "марта", "brand": "CLARINS+THIERRY MUGLER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Сочи", "shop_name": "Рив Гош Сочи-3 МОРЕМОЛЛ", "day": 31.0, "month": "марта", "brand": "CLARINS+THIERRY MUGLER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Тула", "shop_name": "Рив Гош Тула-1 Красноармейский,2", "day": 30.0, "month": "марта", "brand": "CLARINS+THIERRY MUGLER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Благовещенск", "shop_name": "Рив Гош Благовещенск-1 ОСТРОВА", "day": 29.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Великий Новгород", "shop_name": "Рив Гош Великий Новгород-3 МАРМЕЛАД", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Иркутск", "shop_name": "Рив Гош Иркутск-2 СИЛЬВЕР МОЛЛ", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Казань", "shop_name": "Рив Гош Казань-5 АВЕНЮ", "day": 31.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош КОНТИНЕНТ Звездная-1 Ленсовета,97", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЛЕТО", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Набережные Челны", "shop_name": "Рив Гош Набережные Челны-3 САНРАЙЗ СИТИ", "day": 29.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Нальчик", "shop_name": "Рив Гош Нальчик-1 Ленина,34", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НОРД м.пр.Просвещения", "day": 30.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Тверь", "shop_name": "Рив Гош Тверь-1 Тверской,9", "day": 29.0, "month": "марта", "brand": "CLINIQUE", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ПАССАЖ", "day": 29.0, "month": "марта", "brand": "DARPHIN", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Ростов-на-Дону", "shop_name": "Рив Гош Ростов-на-Дону-3 ГОРИЗОНТ", "day": 29.0, "month": "марта", "brand": "DARPHIN", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош БАЛКАНИЯ NOVA 1", "day": 29.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ВЛАДИМИРСКИЙ ПАССАЖ", "day": 29.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Волжский", "shop_name": "Рив Гош Волжский-2 ВОЛГА МОЛЛ", "day": 30.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Набережные Челны", "shop_name": "Рив Гош Набережные Челны-1 М-105", "day": 29.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Набережные Челны", "shop_name": "Рив Гош Набережные Челны-3 САНРАЙЗ СИТИ", "day": 31.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ПАССАЖ", "day": 30.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов, мастер-класс от национального визажиста Dior", "date": "2019-03-30"},
    {"city": "Тюмень", "shop_name": "Рив Гош Тюмень-2 ЦУМ", "day": 30.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Южно-Сахалинск", "shop_name": "Рив Гош Южно-Сахалинск-1 СИТИ МОЛЛ", "day": 30.0, "month": "марта", "brand": "DIOR", "discount": "до 30%", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Новосибирск", "shop_name": "Рив Гош Новосибирск-1 АУРА", "day": 30.0, "month": "марта", "brand": "DKNY+TOMMY HILFIGER+ERMENEGILDO ZEGNA", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НАРВСКИЙ УН-Г", "day": 29.0, "month": "марта", "brand": "DR. JART+", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Благовещенск", "shop_name": "Рив Гош Благовещенск-1 ОСТРОВА", "day": 30.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Краснодар", "shop_name": "Рив Гош Краснодар-6 ГАЛЕРЕЯ КРАСНОДАР", "day": 29.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Набережные Челны", "shop_name": "Рив Гош Набережные Челны-3 САНРАЙЗ СИТИ", "day": 30.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НОРД м.пр.Просвещения", "day": 29.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ПАССАЖ", "day": 29.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Пятигорск", "shop_name": "Рив Гош Пятигорск-2 Крайнего, 56", "day": 30.0, "month": "марта", "brand": "ESTEE LAUDER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош БАЛКАНСКИЙ", "day": 30.0, "month": "марта", "brand": "FIVE ELEMENTS", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЖЕМЧУЖНАЯ ПЛАЗА", "day": 30.0, "month": "марта", "brand": "FIVE ELEMENTS", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ГАЛЕРЕЯ Лиговский,30А", "day": 29.0, "month": "марта", "brand": "GIORGIO ARMANI", "discount": "до 30% на парфюмерию, 25% на макияж", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Благовещенск", "shop_name": "Рив Гош Благовещенск-1 ОСТРОВА", "day": 31.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Владивосток", "shop_name": "Рив Гош Владивосток-1 СЕДАНКА СИТИ", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Воронеж", "shop_name": "Рив Гош Воронеж-2 АРЕНА", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Иваново", "shop_name": "Рив Гош Иваново-1 СЕРЕБРЯНЫЙ ГОРОД", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Казань", "shop_name": "Рив Гош Казань-4 ПАРК ХАУС", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Новороссийск", "shop_name": "Рив Гош Новороссийск-2 ПЕРЕКРЕСТОК", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Новосибирск", "shop_name": "Рив Гош Новосибирск-3 МЕГА", "day": 29.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Новосибирск", "shop_name": "Рив Гош Новосибирск-5 Красный, 29", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Петропавловск-Камчатский", "shop_name": "Рив Гош Петропавловск-Камчатский-1 ГАЛАНТ-СИТИ2", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Сочи", "shop_name": "Рив Гош Сочи-4 (Лазаревское) ПАВЛОВСКИЙ", "day": 29.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Томск", "shop_name": "Рив Гош Томск-1 МОДНЫЙ БАЗАР", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Тюмень", "shop_name": "Рив Гош Тюмень-1 МАГЕЛЛАН", "day": 29.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Ульяновск", "shop_name": "Рив Гош Ульяновск-1 ВЕРСАЛЬ", "day": 29.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Хабаровск", "shop_name": "Рив Гош Хабаровск-1 МАГАЗИНЫ РАДОСТИ", "day": 30.0, "month": "марта", "brand": "GUERLAIN", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ПАССАЖ", "day": 31.0, "month": "марта", "brand": "HELENA RUBINSTEIN", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-31"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НЕВСКИЙ-2 м.Дыбенко", "day": 30.0, "month": "марта", "brand": "KANEBO", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МОСКОВСКИЙ УН-Г", "day": 29.0, "month": "марта", "brand": "KWC", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош БАЛКАНИЯ NOVA 1", "day": 30.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЖЕМЧУЖНАЯ ПЛАЗА", "day": 29.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Казань", "shop_name": "Рив Гош Казань-5 АВЕНЮ", "day": 30.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош КУПЕЧЕСКИЙ ДВОР м.Пионерская", "day": 30.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НЕВСКИЙ-2 м.Дыбенко", "day": 29.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НОРД м.пр.Просвещения", "day": 31.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Ростов-на-Дону", "shop_name": "Рив Гош Ростов-на-Дону-3 ГОРИЗОНТ", "day": 30.0, "month": "марта", "brand": "MAKE UP FOR EVER", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош НАРВСКИЙ УН-Г", "day": 30.0, "month": "марта", "brand": "MAXCLINIC", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Казань", "shop_name": "Рив Гош Казань-5 АВЕНЮ", "day": 29.0, "month": "марта", "brand": "METHODE JEANNE PIAUBERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЛИГОВЪ", "day": 29.0, "month": "марта", "brand": "METHODE JEANNE PIAUBERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕРКУРИЙ Савушкина,141", "day": 29.0, "month": "марта", "brand": "METHODE JEANNE PIAUBERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош БАЛКАНСКИЙ", "day": 29.0, "month": "марта", "brand": "N.1", "discount": "по карте РИВ ГОШ", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош АТМОСФЕРА м.Комендантский пр.", "day": 29.0, "month": "марта", "brand": "NOVEXPERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЗАНЕВСКИЙ КАСКАД-1", "day": 30.0, "month": "марта", "brand": "NOVEXPERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Ростов-на-Дону", "shop_name": "Рив Гош Ростов-на-Дону-2 ЦУМ", "day": 29.0, "month": "марта", "brand": "NOVEXPERT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕГА ДЫБЕНКО", "day": 30.0, "month": "марта", "brand": "PAYOT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош АТМОСФЕРА м.Комендантский пр.", "day": 30.0, "month": "марта", "brand": "SENSAI", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Омск", "shop_name": "Рив Гош Омск-3 МОДНЫЙ ДОМ РОБА", "day": 29.0, "month": "марта", "brand": "SENSAI", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош Пушкин ГОСТИНЫЙ ДВОР", "day": 29.0, "month": "марта", "brand": "SENSAI", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Сочи", "shop_name": "Рив Гош Сочи-3 МОРЕМОЛЛ", "day": 30.0, "month": "марта", "brand": "SENSAI", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош АКАДЕМ ПАРК Гражданский,41", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Владивосток", "shop_name": "Рив Гош Владивосток-1 СЕДАНКА СИТИ", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ГАЛЕРЕЯ Лиговский,30А", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ГРАНД КАНЬОН", "day": 31.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-31"},
    {"city": "Екатеринбург", "shop_name": "Рив Гош Екатеринбург-6 МЕГА", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ЗАНЕВСКИЙ КАСКАД-1", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Краснодар", "shop_name": "Рив Гош Краснодар-5 СБС МЕГАМОЛЛ", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош КУПЕЧЕСКИЙ ДВОР м.Пионерская", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕГА ДЫБЕНКО", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕЖДУНАРОДНЫЙ", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕРКУРИЙ Савушкина,141", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МОСКОВСКИЙ УН-Г", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош Невский,90", "day": 30.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Новосибирск", "shop_name": "Рив Гош Новосибирск-5 Красный, 29", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ПРИМОРСКИЙ", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Ростов-на-Дону", "shop_name": "Рив Гош Ростов-на-Дону-2 ЦУМ", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Самара", "shop_name": "Рив Гош Самара-4 ВИВА ЛЭНД", "day": 29.0, "month": "марта", "brand": "SHISEIDO", "discount": "40", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Норильск", "shop_name": "Рив Гош Норильск-1 АРЕНА", "day": 30.0, "month": "марта", "brand": "SISLEY", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ГАЛЕРЕЯ Лиговский,30А", "day": 31.0, "month": "марта", "brand": "TOM FORD", "discount": "15", "discount_type": "клиентский день", "comment": "консультации, подарки за покупку, угощения", "date": "2019-03-31"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МОСКОВСКИЙ УН-Г", "day": 29.0, "month": "марта", "brand": "TOM FORD", "discount": "15", "discount_type": "клиентский день", "comment": "консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Нижний Новгород", "shop_name": "Рив Гош Нижний Новгород-3 НЕБО", "day": 30.0, "month": "марта", "brand": "VALMONT", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош ГАЛЕРЕЯ Лиговский,30А", "day": 29.0, "month": "марта", "brand": "VALMONT;", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош МЕГА ДЫБЕНКО", "day": 29.0, "month": "марта", "brand": "VIVIENNE SABO", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку", "date": "2019-03-29"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош АКАДЕМ ПАРК Гражданский,41", "day": 29.0, "month": "марта", "brand": "YSL", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Ростов-на-Дону", "shop_name": "Рив Гош Аксай-1 МЕГА РОСТОВ-НА-ДОНУ", "day": 30.0, "month": "марта", "brand": "YSL", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Санкт-Петербург", "shop_name": "Рив Гош Большой ПС,55-ДОМ Рив Гош", "day": 29.0, "month": "марта", "brand": "YSL", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-29"},
    {"city": "Иркутск", "shop_name": "Рив Гош Иркутск-1 МОДНЫЙ КВАРТАЛ", "day": 30.0, "month": "марта", "brand": "YSL", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"},
    {"city": "Краснодар", "shop_name": "Рив Гош Красноярск-2 ПЛАНЕТА", "day": 30.0, "month": "марта", "brand": "YSL", "discount": "30", "discount_type": "клиентский день", "comment": "скидка,консультации, подарки за покупку, работа визажистов", "date": "2019-03-30"}
];

let citiesDiv = document.getElementById('cities');

select.change(function () {
    citiesDiv.innerHTML = '<div id="cities"></div>';

    const selector = document.getElementById('dropdown');
    const value = selector[selector.selectedIndex].text;

    const result = promotions.filter(function (e) {
        return e.city === value;
    });

    console.log(result);

    result.forEach(function (promo) {
        let details = document.createElement('div');
        details.setAttribute('class', 'details');
        // details.outerHTML = '<div class="details"></div>';

        let day = document.createElement('div');
        day.setAttribute('class', 'details__day');
        day.innerText = promo.day + ' ' + promo.month.toUpperCase();

        let shop = document.createElement('div');
        shop.setAttribute('class', 'details__shop');
        shop.innerText = promo.shop_name;

        let stock = document.createElement('div');
        stock.setAttribute('class', 'details__stock');
        stock.innerText = capitalizeFirstLetter(promo.discount_type);

        let brand = document.createElement('div');
        brand.setAttribute('class', 'details__brand');
        brand.innerText = promo.brand;

        let discount = document.createElement('div');
        discount.setAttribute('class', 'details__discount');
        if (promo.discount.length === 2) discount.innerText = promo.discount + '%';
        else discount.innerText = promo.discount;

        let more = document.createElement('div');
        more.setAttribute('class', 'details__more');
        more.innerText = capitalizeFirstLetter(promo.comment);

        details.appendChild(day);
        details.appendChild(shop);
        details.appendChild(stock);
        details.appendChild(brand);
        details.appendChild(discount);
        details.appendChild(more);

        citiesDiv.appendChild(details);
    });
});


function capitalizeFirstLetter(string) {
    return string.charAt(0).toUpperCase() + string.slice(1);
}


